23-views-and-forms/SongTracker/app/controllers/songs_controller.rb

  def index
    # TODO get info from the model
    @songs = Song.all
---
SELECT "songs".* FROM "songs"

  def create
    # make song
    song = Song.new
    # TODO Get info from the form
    # params[:name]
    song.name = params[:song][:name]
    song.artist = params[:song][:artist]
    song.length = params[:song][:length]

    song.save
---
INSERT INTO "songs" ("name", "artist", "length", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Smells like Teen Spirit"], ["artist", "Nirvana"], ["length", 170], ["created_at", "2018-08-09 15:34:02.050399"], ["updated_at", "2018-08-09 15:34:02.050399"]]